[
  {
    "regulation": "DATA_ACT",
    "article": "3",
    "requirement_summary": "Obligation to make data accessible to users",
    "evidence_type": "procedure",
    "artifact_name": "Data Accessibility Procedure",
    "artifact_example": "Data_Accessibility_Procedure_2025.pdf",
    "description": "Documented procedure for making data generated by connected products or related services accessible to users, including technical means, formats, and timeliness of access",
    "retention_period": "Duration of product lifecycle + 3 years",
    "auditor_questions": [
      "How do you make product-generated data accessible to users?",
      "What technical means are provided for users to access their data?",
      "How do you ensure data is provided without undue delay and in a comprehensive format?",
      "Show me evidence that users are informed about what data is generated before purchase"
    ],
    "maturity_levels": {
      "basic": "Basic data export functionality available, manual process for user requests",
      "intermediate": "Automated data access portal, structured data formats, real-time access capabilities",
      "advanced": "API-based continuous data access, machine-readable formats, proactive data delivery to users"
    },
    "cross_references": [
      "GDPR:20",
      "DATA_ACT:4"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "4",
    "requirement_summary": "Right of users to access and use data",
    "evidence_type": "log",
    "artifact_name": "User Data Access Request Log",
    "artifact_example": "User_Data_Access_Log_2025.csv",
    "description": "Log of all user data access requests showing request details, response times, data formats provided, and any refusals with justifications",
    "retention_period": "5 years",
    "auditor_questions": [
      "Show me the log of user data access requests for the past year",
      "What is your average response time for data access requests?",
      "Have you refused any data access requests and on what grounds?",
      "How do you ensure the data provided is of the same quality as available to the data holder?"
    ],
    "maturity_levels": {
      "basic": "Manual tracking of access requests, basic logging",
      "intermediate": "Automated request tracking system, SLA monitoring, structured response process",
      "advanced": "Self-service data access portal, real-time fulfillment, automated quality checks"
    },
    "cross_references": [
      "GDPR:15",
      "DATA_ACT:3"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "5",
    "requirement_summary": "Right to share data with third parties",
    "evidence_type": "procedure",
    "artifact_name": "Third-Party Data Sharing Procedure",
    "artifact_example": "Third_Party_Data_Sharing_Procedure.pdf",
    "description": "Procedure governing how users can request data sharing with third parties, including verification of third-party identity, technical implementation, and safeguards against misuse",
    "retention_period": "Duration of data sharing arrangement + 5 years",
    "auditor_questions": [
      "How do users exercise their right to share data with third parties?",
      "What safeguards are in place to prevent misuse by third parties?",
      "How do you verify the identity and legitimacy of third-party data recipients?",
      "Show me evidence that data sharing does not compromise trade secrets or security"
    ],
    "maturity_levels": {
      "basic": "Manual data sharing process, basic third-party verification",
      "intermediate": "Automated data sharing workflows, contractual safeguards, audit trails",
      "advanced": "API-based data portability, automated compliance checks, real-time monitoring of third-party usage"
    },
    "cross_references": [
      "GDPR:20",
      "DGA:12"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "6",
    "requirement_summary": "Obligations of third parties receiving data",
    "evidence_type": "document",
    "artifact_name": "Third-Party Data Use Agreement",
    "artifact_example": "Third_Party_Data_Use_Agreement_Template.pdf",
    "description": "Standard agreements and controls ensuring third parties only use data for the agreed purpose, do not develop competing products, and implement appropriate security measures",
    "retention_period": "Duration of agreement + 5 years",
    "auditor_questions": [
      "Show me your standard agreements with third-party data recipients",
      "How do you ensure third parties only use data for the agreed purpose?",
      "What controls prevent third parties from developing competing products?",
      "How do you enforce data deletion requirements when the sharing arrangement ends?"
    ],
    "maturity_levels": {
      "basic": "Standard contractual terms exist for third-party data recipients",
      "intermediate": "Contractual compliance monitoring, periodic audits of third-party usage",
      "advanced": "Technical enforcement of usage restrictions, automated compliance verification, real-time usage analytics"
    },
    "cross_references": [
      "GDPR:28",
      "DATA_ACT:5"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "8",
    "requirement_summary": "Unfair contractual terms relating to data access",
    "evidence_type": "document",
    "artifact_name": "Contractual Fairness Assessment",
    "artifact_example": "Data_Contract_Fairness_Review_2025.pdf",
    "description": "Assessment of contractual terms related to data access and use to ensure they are not unfairly imposed on micro, small, or medium enterprises, including review of unilateral clauses and liability limitations",
    "retention_period": "Duration of contract + 5 years",
    "auditor_questions": [
      "How do you assess whether contractual terms for data access are fair?",
      "Show me your review process for identifying potentially unfair terms",
      "Have you identified and remediated any unfair contractual terms?",
      "How do you ensure compliance with the fairness test under Article 13?"
    ],
    "maturity_levels": {
      "basic": "Legal review of key contracts for obvious unfair terms",
      "intermediate": "Systematic fairness assessment across all data-related contracts, remediation tracking",
      "advanced": "Automated contract analysis tools, proactive fairness design, regular benchmarking against market standards"
    },
    "cross_references": [
      "DATA_ACT:13"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "14",
    "requirement_summary": "Dispute settlement for data sharing",
    "evidence_type": "procedure",
    "artifact_name": "Data Dispute Settlement Procedure",
    "artifact_example": "Data_Dispute_Settlement_Process.pdf",
    "description": "Documented procedure for resolving disputes related to data access and sharing, including access to certified dispute settlement bodies and internal escalation mechanisms",
    "retention_period": "Duration of operations + 3 years",
    "auditor_questions": [
      "What is your procedure for handling disputes related to data access or sharing?",
      "Have you identified certified dispute settlement bodies for escalation?",
      "Show me records of any data-related disputes and their resolution",
      "How do you ensure dispute resolution is accessible and affordable for SMEs?"
    ],
    "maturity_levels": {
      "basic": "Basic complaint process documented, awareness of dispute settlement bodies",
      "intermediate": "Formal internal dispute resolution process, trained staff, documented case handling",
      "advanced": "Integrated dispute management system, proactive dispute prevention, analytics on dispute patterns"
    },
    "cross_references": [
      "DSA:20"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "23",
    "requirement_summary": "Switching between data processing services",
    "evidence_type": "procedure",
    "artifact_name": "Cloud Service Switching Procedure",
    "artifact_example": "Cloud_Switching_Procedure_2025.pdf",
    "description": "Documented procedure enabling customers to switch between data processing services including cloud, edge, and similar services, covering data portability, transition periods, and functional equivalence",
    "retention_period": "Duration of service + 3 years",
    "auditor_questions": [
      "Show me your documented switching procedure for data processing services",
      "What is the maximum transition period you support for customer switching?",
      "How do you ensure data portability during the switching process?",
      "What charges apply during the switching period and are they compliant with the phase-out timeline?"
    ],
    "maturity_levels": {
      "basic": "Basic data export capabilities, documented switching process",
      "intermediate": "Standardised data formats, assisted migration tools, clear switching timelines",
      "advanced": "Automated migration tools, zero-downtime switching, functional equivalence testing"
    },
    "cross_references": [
      "DATA_ACT:25"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "25",
    "requirement_summary": "Technical aspects of switching",
    "evidence_type": "document",
    "artifact_name": "Technical Switching Specifications",
    "artifact_example": "Technical_Switching_Specs_2025.pdf",
    "description": "Technical documentation covering open interfaces, interoperability standards, data format specifications, and APIs that enable switching between data processing services",
    "retention_period": "Duration of service + 3 years",
    "auditor_questions": [
      "What open interfaces and APIs do you provide for data portability?",
      "Show me your technical specifications for data export formats",
      "How do you ensure compatibility with common industry standards?",
      "What testing do you perform to verify successful data migration?"
    ],
    "maturity_levels": {
      "basic": "Basic data export in common formats, API documentation available",
      "intermediate": "Open standards-based APIs, migration testing tools, interoperability validation",
      "advanced": "Full API compatibility suite, automated migration validation, continuous interoperability testing"
    },
    "cross_references": [
      "DATA_ACT:23"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "28",
    "requirement_summary": "International transfer safeguards for non-personal data",
    "evidence_type": "policy",
    "artifact_name": "International Data Transfer Policy",
    "artifact_example": "International_Data_Transfer_Policy.pdf",
    "description": "Policy and safeguards for preventing unlawful international access to and transfer of non-personal data held in the EU, including risk assessments and contractual protections",
    "retention_period": "Duration of operations + 5 years",
    "auditor_questions": [
      "What safeguards do you have against unlawful international government access to data?",
      "Show me your risk assessment for international data transfers",
      "How do you handle requests from third-country authorities for EU-held data?",
      "What contractual measures protect against non-EU jurisdictional access?"
    ],
    "maturity_levels": {
      "basic": "Policy exists covering international data transfer restrictions",
      "intermediate": "Risk assessments performed, contractual safeguards in place, staff trained",
      "advanced": "Automated data residency controls, continuous monitoring of access patterns, legal response playbooks"
    },
    "cross_references": [
      "GDPR:44",
      "GDPR:46"
    ]
  },
  {
    "regulation": "DATA_ACT",
    "article": "31",
    "requirement_summary": "Public sector access to privately held data in exceptional need",
    "evidence_type": "procedure",
    "artifact_name": "Public Sector Data Request Handling Procedure",
    "artifact_example": "Public_Sector_Data_Request_Procedure.pdf",
    "description": "Procedure for handling data access requests from public sector bodies in cases of exceptional need such as public emergencies, including validation, proportionality assessment, and response protocols",
    "retention_period": "Duration of operations + 5 years",
    "auditor_questions": [
      "How do you validate and process data requests from public sector bodies?",
      "What is your process for assessing the proportionality of public sector requests?",
      "Show me records of any public sector data requests and how they were handled",
      "How do you ensure compliance with conditions and limitations under Article 31?"
    ],
    "maturity_levels": {
      "basic": "Basic procedure exists for receiving and responding to public sector requests",
      "intermediate": "Formal validation workflow, legal review process, response tracking",
      "advanced": "Automated request processing, real-time legal assessment, secure data delivery channels"
    },
    "cross_references": [
      "GDPR:6",
      "DGA:5"
    ]
  }
]
